Revit 2026 API

# ColorOptions Class

---

A class providing access to color settings which affect the colors applied to specific views.

SystemObject Autodesk.Revit.DBColorOptions

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ColorOptions : IDisposable
```
```vb
Public Class ColorOptions
	Implements IDisposable
```
```cpp
public ref class ColorOptions : IDisposable
```
```fsharp
type ColorOptions =
    class
        interface IDisposable
    end
```

The ColorOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AlertColor | The color of the current canvas theme used to highlight elements when a special alert is required. |
|  | BackgroundColor | The background color of the current canvas theme applied to views. |
|  | CalculatingColor | The color of the current canvas theme used to render elements when some aspect of their properties is currently being recalculated. |
|  | EditingColor | The color of the current canvas theme used to render elements when editing. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | PreselectionColor | The color of the current canvas theme used to highlight candidates for selection before they are selected. |
|  | SelectionColor | The color of the current canvas theme used to highlight selected elements. |
|  | SelectionSemitransparent | Indicates whether or not selections will be shown in a semi-transparent manner in current canvas theme. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the ColorOptions |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetColorOptions | Returns the current Revit instance's ColorOptions. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

ColorOptions are managed and stored along with other global application options and thus impact the application as a whole.

#### Reference

Autodesk.Revit.DB Namespace